In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("amazon_sales_data_kaggle.csv")

In [3]:
df.head()

,OrderID,Date,Product,Category,Price,Quantity,TotalSales,CustomerName,CustomerLocation,PaymentMethod,Status
0,ORD0001,02-02-2025,Running Shoes,Footwear,60,3,180,Emma Clark,New York,Debit Card,Cancelled
1,ORD0002,03-02-2025,Headphones,Electronics,100,4,400,Emily Johnson,San Francisco,Debit Card,Pending
2,ORD0003,03-02-2025,Running Shoes,Footwear,60,2,120,John Doe,Denver,Amazon Pay,Cancelled
3,ORD0004,03-02-2025,Running Shoes,Footwear,60,3,180,Olivia Wilson,Dallas,Credit Card,Pending
4,ORD0005,04-02-2025,Smartwatch,Electronics,150,3,450,Emma Clark,New York,Debit Card,Pending

In [4]:
df.describe()

             Price    Quantity   TotalSales
count   250.000000  250.000000   250.000000
mean    343.580000    2.856000   975.380000
std     380.635808    1.429489  1252.112254
min      15.000000    1.000000    15.000000
25%      40.000000    2.000000   100.000000
50%     150.000000    3.000000   400.000000
75%     600.000000    4.000000  1500.000000
max    1200.000000    5.000000  6000.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   OrderID           250 non-null    object
 1   Date              250 non-null    object
 2   Product           250 non-null    object
 3   Category          250 non-null    object
 4   Price             250 non-null    int64
 5   Quantity          250 non-null    int64
 6   TotalSales        250 non-null    int64
 7   CustomerName      250 non-null    object
 8   CustomerLocation  250 non-null    object
 9   PaymentMethod     250 non-null    object
 10  Status            250 non-null    object
dtypes: int64(3), object(8)
memory usage: 21.6+ KB

In [6]:
target_rows = 3000
rows_to_add = target_rows - len(df)

In [7]:
for i in df.columns:
    print(i)

OrderID
Date
Product
Category
Price
Quantity
TotalSales
CustomerName
CustomerLocation
PaymentMethod
Status

In [8]:
unique=[]
for i in df['Product']:
    if i not in unique:
        unique.append(i)
for i in unique:
    print(i)

Running Shoes
Headphones
Smartwatch
T-Shirt
Smartphone
Book
Jeans
Laptop
Washing Machine
Refrigerator

In [9]:
unique=[]
for i in df['Category']:
    if i not in unique:
        unique.append(i)
for i in unique:
    print(i)

Footwear
Electronics
Clothing
Books
Home Appliances

In [10]:
unique=[]
for i in df['CustomerName']:
    if i not in unique:
        unique.append(i)
for i in unique:
    print(i)

Emma Clark
Emily Johnson
John Doe
Olivia Wilson
Sophia Miller
David Lee
Michael Brown
Daniel Harris
Chris White
Jane Smith

In [11]:
unique=[]
for i in df['CustomerLocation']:
    if i not in unique:
        unique.append(i)
for i in unique:
    print(i)

New York
San Francisco
Denver
Dallas
Houston
Miami
Boston
Seattle
Los Angeles
Chicago

In [12]:
unique=[]
for i in df['PaymentMethod']:
    if i not in unique:
        unique.append(i)
for i in unique:
    print(i)

Debit Card
Amazon Pay
Credit Card
PayPal
Gift Card

In [13]:
unique=[]
for i in df['Status']:
    if i not in unique:
        unique.append(i)
for i in unique:
    print(i)

Cancelled
Pending
Completed

In [14]:
# Number of new rows to add (e.g., 100)
n_new_rows = 2750

In [15]:
# Generate new rows via bootstrapping
new_rows = df.sample(n=n_new_rows, replace=True, random_state=42)

In [16]:
# Append to original dataset
extended_df = pd.concat([df, new_rows], ignore_index=True)

In [17]:
df.describe()

             Price    Quantity   TotalSales
count   250.000000  250.000000   250.000000
mean    343.580000    2.856000   975.380000
std     380.635808    1.429489  1252.112254
min      15.000000    1.000000    15.000000
25%      40.000000    2.000000   100.000000
50%     150.000000    3.000000   400.000000
75%     600.000000    4.000000  1500.000000
max    1200.000000    5.000000  6000.000000

In [18]:
extended_df.describe()

             Price     Quantity   TotalSales
count  3000.000000  3000.000000  3000.000000
mean    333.990000     2.876667   975.110000
std     370.708225     1.438800  1260.864491
min      15.000000     1.000000    15.000000
25%      40.000000     2.000000   100.000000
50%     150.000000     3.000000   400.000000
75%     600.000000     4.000000  1500.000000
max    1200.000000     5.000000  6000.000000

In [19]:
#extended_df.to_csv('amazon_sales_data_kaggle2.csv')

In [20]:
from datetime import date

def assign_random_dates(num_rows=3000, start_year=2018, end_date_str='2025-06-27'):
    end_date = pd.to_datetime(end_date_str)
    
    # Create the start date
    start_date = pd.to_datetime(f'{start_year}-01-01')

    # 1. Generate the complete date range
    all_dates = pd.date_range(start=start_date, end=end_date)
    
    # Convert to Python date objects if preferred for the final output, or keep as Timestamps
    all_dates_list = all_dates.tolist() # Keep as Timestamps for now for easy manipulation

    # 2. Determine random occurrences for each date
    # We need to distribute num_rows (3000) randomly across all_dates_list.
    # A simple way is to draw 'num_rows' dates randomly from 'all_dates_list'
    # with replacement. This ensures randomness and the correct total number of dates.

    if len(all_dates_list) == 0:
        raise ValueError("The date range is empty. Check your start and end dates.")
    
    # Generate random indices to pick dates from the all_dates_list
    random_indices = np.random.choice(len(all_dates_list), size=num_rows, replace=True)
    
    # Select dates based on random indices
    assigned_dates = [all_dates_list[i] for i in random_indices]

    # Shuffle the assigned_dates to ensure they are not in a specific order based on index generation
    np.random.shuffle(assigned_dates)
    
    # 3. Create the DataFrame and assign dates
    df = pd.DataFrame({'Data': range(num_rows)}) # Create a dummy DataFrame with num_rows
    df['Date'] = assigned_dates

    # Sort by date for better visualization (optional)
    df = df.sort_values(by='Date').reset_index(drop=True)
    
    return df

In [21]:
# Example usage:
num_rows = 3000
start_year = 2018
end_date_str = '2025-06-27' # Current date is June 27, 2025

In [22]:
df_with_dates = assign_random_dates(num_rows, start_year, end_date_str)

In [23]:
print(f"DataFrame with {num_rows} rows and randomly assigned dates:")

DataFrame with 3000 rows and randomly assigned dates:

In [24]:
print(df_with_dates.head())

   Data       Date
0   279 2018-01-01
1   749 2018-01-01
2   456 2018-01-01
3  2369 2018-01-02
4   980 2018-01-02

In [25]:
print(f"\nDataFrame Info:")
df_with_dates.info()

DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    3000 non-null   int64
 1   Date    3000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(1)
memory usage: 47.0 KB

In [26]:
print(f"\nDate range in the DataFrame: {df_with_dates['Date'].min().date()} to {df_with_dates['Date'].max().date()}")

Date range in the DataFrame: 2018-01-01 to 2025-06-27

In [27]:
print(f"\nNumber of unique dates: {df_with_dates['Date'].nunique()}")

Number of unique dates: 1819

In [28]:
print(f"\nCounts of top 10 most frequent dates:")
print(df_with_dates['Date'].value_counts().head(10))

Counts of top 10 most frequent dates:
2018-11-13    7
2024-10-19    6
2020-10-08    6
2022-12-27    6
2022-05-17    5
2024-07-14    5
2023-04-15    5
2021-07-04    5
2022-09-02    5
2023-01-24    5
Name: Date, dtype: int64

In [29]:
df_with_dates.head()

   Data       Date
0   279 2018-01-01
1   749 2018-01-01
2   456 2018-01-01
3  2369 2018-01-02
4   980 2018-01-02

In [30]:
df_with_dates['Date']

0      2018-01-01
1      2018-01-01
2      2018-01-01
3      2018-01-02
4      2018-01-02
          ...
2995   2025-06-21
2996   2025-06-25
2997   2025-06-25
2998   2025-06-27
2999   2025-06-27
Name: Date, Length: 3000, dtype: datetime64[ns]

In [31]:
extended_df['Date'] = pd.to_datetime(df_with_dates['Date'])

In [32]:
extended_df.head()

,OrderID,Date,Product,Category,Price,Quantity,TotalSales,CustomerName,CustomerLocation,PaymentMethod,Status
0,ORD0001,2018-01-01,Running Shoes,Footwear,60,3,180,Emma Clark,New York,Debit Card,Cancelled
1,ORD0002,2018-01-01,Headphones,Electronics,100,4,400,Emily Johnson,San Francisco,Debit Card,Pending
2,ORD0003,2018-01-01,Running Shoes,Footwear,60,2,120,John Doe,Denver,Amazon Pay,Cancelled
3,ORD0004,2018-01-02,Running Shoes,Footwear,60,3,180,Olivia Wilson,Dallas,Credit Card,Pending
4,ORD0005,2018-01-02,Smartwatch,Electronics,150,3,450,Emma Clark,New York,Debit Card,Pending

In [33]:
#extended_df.to_csv('amazon_sales_data_kaggle2.csv')

In [34]:
extended_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   OrderID           3000 non-null   object
 1   Date              3000 non-null   datetime64[ns]
 2   Product           3000 non-null   object
 3   Category          3000 non-null   object
 4   Price             3000 non-null   int64
 5   Quantity          3000 non-null   int64
 6   TotalSales        3000 non-null   int64
 7   CustomerName      3000 non-null   object
 8   CustomerLocation  3000 non-null   object
 9   PaymentMethod     3000 non-null   object
 10  Status            3000 non-null   object
dtypes: datetime64[ns](1), int64(3), object(7)
memory usage: 257.9+ KB

In [35]:
num_rows = 3000
df2 = pd.DataFrame({'dummy_column': range(num_rows)})

# Create a Series of numbers (converted to string)
order_numbers = pd.Series(range(1, num_rows + 1)).astype(str)

# Create a Series of the prefix
prefix = pd.Series(['ORD'] * num_rows)

# Concatenate them
df2['OrderID'] = prefix.str.cat(order_numbers)

print(df2.head())
print(df2.tail())
print(f"Total unique OrderIDs: {df2['OrderID'].nunique()}")

   dummy_column OrderID
0             0    ORD1
1             1    ORD2
2             2    ORD3
3             3    ORD4
4             4    ORD5
      dummy_column  OrderID
2995          2995  ORD2996
2996          2996  ORD2997
2997          2997  ORD2998
2998          2998  ORD2999
2999          2999  ORD3000
Total unique OrderIDs: 3000

In [36]:
extended_df['OrderID'] = df2['OrderID']

In [37]:
extended_df.head()

,OrderID,Date,Product,Category,Price,Quantity,TotalSales,CustomerName,CustomerLocation,PaymentMethod,Status
0,ORD1,2018-01-01,Running Shoes,Footwear,60,3,180,Emma Clark,New York,Debit Card,Cancelled
1,ORD2,2018-01-01,Headphones,Electronics,100,4,400,Emily Johnson,San Francisco,Debit Card,Pending
2,ORD3,2018-01-01,Running Shoes,Footwear,60,2,120,John Doe,Denver,Amazon Pay,Cancelled
3,ORD4,2018-01-02,Running Shoes,Footwear,60,3,180,Olivia Wilson,Dallas,Credit Card,Pending
4,ORD5,2018-01-02,Smartwatch,Electronics,150,3,450,Emma Clark,New York,Debit Card,Pending

In [38]:
extended_df.tail()

,OrderID,Date,Product,Category,Price,Quantity,TotalSales,CustomerName,CustomerLocation,PaymentMethod,Status
2995,ORD2996,2025-06-21,Laptop,Electronics,800,5,4000,Emily Johnson,Denver,PayPal,Completed
2996,ORD2997,2025-06-25,Smartwatch,Electronics,150,1,150,Chris White,Houston,Debit Card,Pending
2997,ORD2998,2025-06-25,Smartwatch,Electronics,150,2,300,Emma Clark,Dallas,Credit Card,Completed
2998,ORD2999,2025-06-27,Smartwatch,Electronics,150,4,600,Olivia Wilson,Miami,PayPal,Cancelled
2999,ORD3000,2025-06-27,Laptop,Electronics,800,4,3200,Emma Clark,Los Angeles,Credit Card,Completed

In [39]:
#extended_df.to_csv('amazon_sales_data_kaggle2.csv')

In [40]:
df_updated = extended_df.copy()

In [41]:
# Base cost mapping for 2018
base_cost_2018 = {
        'Running Shoes': 2250,
        'Headphones': 2500,
        'Smartwatch': 2000,
        'T-Shirt': 749,
        'Smartphone': 5991,
        'Book': 200,
        'Jeans': 1600,
        'Laptop': 37500,
        'Washing Machine': 16000,
        'Refrigerator': 20000
}

In [42]:
# Year-based price increases (cumulative from 2018 base)
year_increases = {
        2018: 0,
        2019: 4.5,
        2020: 9.2,
        2021: 14.1,
        2022: 19.2,
        2023: 24.6,
        2024: 30.7,
        2025: 36.0
}

In [43]:
# Margin percentages for each product
margins = {
        'Running Shoes': 30.0,
        'Headphones': 20.0,
        'Smartwatch': 22.5,
        'T-Shirt': 55.0,
        'Smartphone': 11.5,
        'Book': 15.0,
        'Jeans': 45.0,
        'Laptop': 17.5,
        'Washing Machine': 20.0,
        'Refrigerator': 15.0
}

In [44]:
# Ensure Date column is datetime
df_updated['Date'] = pd.to_datetime(df_updated['Date'])

In [45]:
# Extract year from date
df_updated['Year'] = df_updated['Date'].dt.year

In [46]:
# Initialize BaseCost and SellingPrice columns
df_updated['BaseCost'] = 0.0
df_updated['SellingPrice'] = 0.0

In [47]:
# Calculate BaseCost and SellingPrice for each row
for idx, row in df_updated.iterrows():
    product = row['Product']
    year = row['Year']

    # Get base cost for 2018
    base_2018 = base_cost_2018.get(product, 0)

    # Get year increase percentage
    year_increase = year_increases.get(year, 0)

    # Calculate BaseCost with year adjustment
    # BaseCost = Base2018 + (Base2018 * YearIncrease / 100)
    base_cost = base_2018 + (base_2018 * year_increase / 100)
    df_updated.at[idx, 'BaseCost'] = round(base_cost, 2)

    # Get margin for the product
    margin_percent = margins.get(product, 0)

    # Calculate SellingPrice
    # SellingPrice = BaseCost + (BaseCost * Margin / 100)
    selling_price = base_cost + (base_cost * margin_percent / 100)
    df_updated.at[idx, 'SellingPrice'] = round(selling_price, 2)

In [48]:
df_updated['TotalSales'] = df_updated['SellingPrice'] * df_updated['Quantity']

In [49]:
df_updated.columns

Index(['OrderID', 'Date', 'Product', 'Category', 'Price', 'Quantity',
       'TotalSales', 'CustomerName', 'CustomerLocation', 'PaymentMethod',
       'Status', 'Year', 'BaseCost', 'SellingPrice'],
      dtype='object')

In [50]:
cols = ['OrderID', 'Date', 'Product', 'Category','BaseCost',
       'SellingPrice','Quantity','TotalSales', 'CustomerName', 
        'CustomerLocation', 'PaymentMethod','Status']

In [51]:
df_updated = df_updated[cols]

In [52]:
df_updated

,OrderID,Date,Product,Category,BaseCost,SellingPrice,Quantity,TotalSales,CustomerName,CustomerLocation,PaymentMethod,Status
0,ORD1,2018-01-01,Running Shoes,Footwear,2250.0,2925.0,3,8775.0,Emma Clark,New York,Debit Card,Cancelled
1,ORD2,2018-01-01,Headphones,Electronics,2500.0,3000.0,4,12000.0,Emily Johnson,San Francisco,Debit Card,Pending
2,ORD3,2018-01-01,Running Shoes,Footwear,2250.0,2925.0,2,5850.0,John Doe,Denver,Amazon Pay,Cancelled
3,ORD4,2018-01-02,Running Shoes,Footwear,2250.0,2925.0,3,8775.0,Olivia Wilson,Dallas,Credit Card,Pending
4,ORD5,2018-01-02,Smartwatch,Electronics,2000.0,2450.0,3,7350.0,Emma Clark,New York,Debit Card,Pending
...,...,...,...,...,...,...,...,...,...,...,...,...
2995,ORD2996,2025-06-21,Laptop,Electronics,51000.0,59925.0,5,299625.0,Emily Johnson,Denver,PayPal,Completed
2996,ORD2997,2025-06-25,Smartwatch,Electronics,2720.0,3332.0,1,3332.0,Chris White,Houston,Debit Card,Pending
2997,ORD2998,2025-06-25,Smartwatch,Electronics,2720.0,3332.0,2,6664.0,Emma Clark,Dallas,Credit Card,Completed
2998,ORD2999,2025-06-27,Smartwatch,Electronics,2720.0,3332.0,4,13328.0,Olivia Wilson,Miami,PayPal,Cancelled
2999,ORD3000,2025-06-27,Laptop,Electronics,51000.0,59925.0,4,239700.0,Emma Clark,Los Angeles,Credit Card,Completed

In [53]:
#df_updated.to_csv('amazon_sales_data_kaggle3.csv')

In [54]:
names = pd.read_csv("Name_City.csv")
names.head()

           Name       City
0  Aarav Sharma  Bengaluru
1   Aditi Singh     Mumbai
2   Advik Gupta      Delhi
3  Ananya Patel    Chennai
4   Arjun Kumar    Kolkata

In [55]:
# Determine how many new rows are needed
current_rows = len(names)
target_rows = 3000
rows_to_add = target_rows - current_rows

In [57]:
if rows_to_add <= 0:
    print(f"Your dataset already has {current_rows} rows. No new rows will be added.")
else:
    # Randomly sample from the original DataFrame to create the new rows
    # `replace=True` allows for duplicate selections, ensuring we can reach 3000 rows
    new_rows_df = names.sample(n=rows_to_add, replace=True, random_state=42) # random_state for reproducibility

    # Concatenate the original and new rows
    name_df = pd.concat([names, new_rows_df]).reset_index(drop=True)
    print(f"Successfully expanded dataset to {len(name_df)} rows. Saved as 'expanded_data.csv'")

Successfully expanded dataset to 3000 rows. Saved as 'expanded_data.csv'

In [58]:
name_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3000 non-null   object
 1   City    3000 non-null   object
dtypes: object(2)
memory usage: 47.0+ KB

In [59]:
df_updated['CustomerName'] = name_df['Name']
df_updated['CustomerLocation'] = name_df['City']

In [60]:
df_updated.head()

,OrderID,Date,Product,Category,BaseCost,SellingPrice,Quantity,TotalSales,CustomerName,CustomerLocation,PaymentMethod,Status
0,ORD1,2018-01-01,Running Shoes,Footwear,2250.0,2925.0,3,8775.0,Aarav Sharma,Bengaluru,Debit Card,Cancelled
1,ORD2,2018-01-01,Headphones,Electronics,2500.0,3000.0,4,12000.0,Aditi Singh,Mumbai,Debit Card,Pending
2,ORD3,2018-01-01,Running Shoes,Footwear,2250.0,2925.0,2,5850.0,Advik Gupta,Delhi,Amazon Pay,Cancelled
3,ORD4,2018-01-02,Running Shoes,Footwear,2250.0,2925.0,3,8775.0,Ananya Patel,Chennai,Credit Card,Pending
4,ORD5,2018-01-02,Smartwatch,Electronics,2000.0,2450.0,3,7350.0,Arjun Kumar,Kolkata,Debit Card,Pending

In [61]:
df_updated.to_csv('amazon_sales_data_kaggle4.csv')

In [62]:
type(df_updated['Date'])

pandas.core.series.Series

In [63]:
df_updated.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   OrderID           3000 non-null   object
 1   Date              3000 non-null   datetime64[ns]
 2   Product           3000 non-null   object
 3   Category          3000 non-null   object
 4   BaseCost          3000 non-null   float64
 5   SellingPrice      3000 non-null   float64
 6   Quantity          3000 non-null   int64
 7   TotalSales        3000 non-null   float64
 8   CustomerName      3000 non-null   object
 9   CustomerLocation  3000 non-null   object
 10  PaymentMethod     3000 non-null   object
 11  Status            3000 non-null   object
dtypes: datetime64[ns](1), float64(3), int64(1), object(7)
memory usage: 281.4+ KB